tutorials/compressible/steadyCompressibleMRFFoam/simpleRotorStator/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="steadyCompressibleMRFFoam"

runApplication blockMesh
runApplication setSet -batch setSet.batch
runApplication setsToZones
runApplication $application
