tutorials/compressible/steadyCompressibleMRFFoam/simpleRotorStator/constant/MRFZones
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      MRFZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

1
(
    rotor
    {
        // Fixed patches (by default they 'move' with the MRF zone)
        nonRotatingPatches ();

        origin    origin [0 1 0 0 0 0 0]  (0 0 0);
        axis      axis   [0 0 0 0 0 0 0]  (1 0 0);
//         omega     omega  [0 0 -1 0 0 0 0] 5231.25;   // 50k rpm, Utip = 261 m/s
        omega     omega  [0 0 -1 0 0 0 0]  2094.395; // 20k rpm, Utip = 100 m/s
//         omega     omega  [0 0 -1 0 0 0 0] 523.125;   // 5k rpm, utip = 25.1 m/s
    }
)

// ************************************************************************* //
